In [13]:
import sklearn
import pandas as pd
import matplotlib
%matplotlib inline

# Load data set

In [3]:
df = pd.read_csv('people-example.csv')

In [8]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [18]:
df['age'].mean()

23.142857142857142

In [22]:
 df['age'].max()

25

In [23]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [28]:
def transform(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [30]:
transform('USA')

'United States'

In [34]:
df['Country'].apply(transform)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [36]:
df['Country'] = df['Country'].apply(transform)

In [37]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward